api/models/LoginForm.php

    public function appGetTeamID($password = "")
    {
        $team = Team::findOne(['phone' => $this->phone]);
---
SELECT * FROM `team` WHERE `phone`='18601019312'

    protected function appGetUser()
    {
        if ($this->_team === null) {
            $this->_team = Team::findOne(['phone' => $this->phone]);
---
SELECT * FROM `team` WHERE `phone`='18601019312'

    public function onAppGenerateApiToken ()
    {
        if (!Team::apiTokenIsValid($this->_team->api_token)) {
            $this->_team->appGenerateApiToken($this->_team->id);
            $this->_team->save(false);
---
UPDATE `team` SET `api_token`='1ef43ba9fd2dd539bf9ef69af93224e3529c81fe1a4b920c672df9f10de4d245akZsZ0d6WUpvME5PVnAyQW5BeUFaZFV6ZVFxZHF1dk5fakZsZ0d6WUpvME5PVnAyQW5BeUFaZFV6ZVFxZHF1dk5fMTU0NjAwOTc1M182MDE=' WHERE `id`=601