api/models/MiniProgram.php

SELECT * FROM `team` WHERE `id`='601'
---
    protected function perCenterInterface()
    {
        $echoData = [];

        if($this->teamID)
        {
            $echoData['code'] = 200;
            $team = Team::findOne((int) $this->teamID);