api/models/Team.php

SELECT * FROM `team` WHERE `api_token`='de009637b18fbb29fa6874b3158afdbe1c814057be2da6b8dc8b58af64c53d38N1Y5em80VmtBcFliQTY2ZlZkb0tkMHNxdk0zVHM0Z1JfN1Y5em80VmtBcFliQTY2ZlZkb0tkMHNxdk0zVHM0Z1JfMTU0NTQ5NzgwOV82MDE='
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        // 如果token无效的话，
        if(!static::apiTokenIsValid($token))
            throw new UnauthorizedHttpException("token 是非法的");

        return static::findOne(['api_token' => $token]);